1. 在新数据库中新建一张 user 表,插入几条数据,属性包含:唯一标识(id),姓名(name)性别(sex).年龄(age).联系方式(phone)
```sql
mysql> CREATE DATABASE HW5;
Query OK, 1 row affected (0.01 sec)

mysql> SHOW DATABASES;
+--------------------+
| Database           |
+--------------------+
| hw5                |
| information_schema |
| mysql              |
| performance_schema |
| sys                |
+--------------------+
5 rows in set (0.00 sec)

mysql> USE HW5;
Database changed

mysql> CREATE TABLE user (
    -> id INT AUTO_INCREMENT PRIMARY KEY,
    -> name VARCHAR(50) NOT NULL,
    -> sex VARCHAR(10) NOT NULL,
    -> age INT,
    -> phone VARCHAR(20)
    -> );
Query OK, 0 rows affected (0.02 sec)

mysql> INSERT INTO user (name, sex, age, phone) VALUES
    -> ('John Doe', 'Male', 25, '123-456-7890'),
    -> ('Jane Smith', 'Female', 31, '987-654-3210'),
    -> ('Bob Johnson', 'Male', 22, '555-123-4567');
Query OK, 3 rows affected (0.01 sec)
Records: 3  Duplicates: 0  Warnings: 0
```

2. 写出 SQL语句,查询 user 表中所有年龄在 20-30 范围内的用户
```sql
mysql> SELECT * FROM user WHERE age BETWEEN 20 AND 30;
+----+-------------+------+------+--------------+
| id | name        | sex  | age  | phone        |
+----+-------------+------+------+--------------+
|  1 | John Doe    | Male |   25 | 123-456-7890 |
|  3 | Bob Johnson | Male |   22 | 555-123-4567 |
+----+-------------+------+------+--------------+
2 rows in set (0.00 sec)
```

3. 写出SQL语句，向user表中添加自己的个人信息，并添加几条和你姓名同姓的虚拟信息。
```sql
mysql> INSERT INTO user (name, sex, age, phone) VALUES
    -> ('Leyi Shao','Female',19,'111-222-3333'),
    -> ('Leah Shao','Female',35,'123-234-3333'),
    -> ('Roxxine Shao', 'Female', 22, '185-123-4567'),
    -> ('Robert Shao','Male',60,'156-2574-2852');
Query OK, 4 rows affected (0.01 sec)
Records: 4  Duplicates: 0  Warnings: 0
```

4. 写出 SQL语句,查询 user 表中年龄在 20-30 范围内,名字包含“你的姓氏”的用户,并按照年龄从大到小排序输出
```sql
mysql> SELECT * FROM user WHERE age BETWEEN 20 AND 30 AND name LIKE '%Shao%' ORDER BY age DESC;
+----+--------------+--------+------+--------------+
| id | name         | sex    | age  | phone        |
+----+--------------+--------+------+--------------+
|  7 | Roxxine Shao | Female |   22 | 185-123-4567 |
+----+--------------+--------+------+--------------+
1 row in set (0.00 sec)
```

5. 写出 SQL 语句,计算 user 表中所有用户的平均年龄
```sql
mysql> SELECT AVG(age) FROM user;
+----------+
| AVG(age) |
+----------+
|  30.5714 |
+----------+
1 row in set (0.00 sec)
```

6. 新建两张表team 表(id,teamName)和score 表(id,teamid,userid,score)。其中score 表中的 teamid 为指向 team表id 的外键，userid 为指向 user表id的外键
```sql
mysql> CREATE TABLE team (
    -> id INT AUTO_INCREMENT PRIMARY KEY,
    -> teamName VARCHAR(50)
    -> );
Query OK, 0 rows affected (0.01 sec)

mysql> CREATE TABLE score (
    -> id INT AUTO_INCREMENT PRIMARY KEY,
    -> teamid INT,
    -> userid INT,
    -> score INT,
    -> FOREIGN KEY (teamid) REFERENCES team(id),
    -> FOREIGN KEY (userid) REFERENCES user(id)
    -> );
Query OK, 0 rows affected (0.04 sec)
```

7. 在team表中和score表中插入合适的记录，写出 SQL语句,查询 teamName 为“ECNU”的队伍中，年龄小于 20 的用户们，结果不得为空。
```sql
mysql> INSERT INTO team (teamName) VALUES ('ECNU'), ('SHU');
Query OK, 2 rows affected (0.01 sec)

mysql> INSERT INTO score (teamid, userid, score) VALUES 
    -> (1, 4, 90), 
    -> (2, 5, 75), 
    -> (1, 2, 80)
    -> (1, 3, NULL);
Query OK, 3 rows affected (0.01 sec)

mysql> SELECT u.* FROM user u
    -> JOIN score s ON u.id = s.userid
    -> JOIN team t ON s.teamid = t.id
    -> WHERE t.teamName = 'ECNU' AND u.age < 20;
+----+-----------+--------+------+--------------+
| id | name      | sex    | age  | phone        |
+----+-----------+--------+------+--------------+
|  4 | Leyi Shao | Female |   19 | 111-222-3333 |
+----+-----------+--------+------+--------------+
1 row in set (0.00 sec)
```

8. 写出 SQL 语句,计算 teamName为“ECNU”的总分(假设 score 存在 null值,nul值默认为 0 加入计算)。

```sql
mysql> SELECT SUM(COALESCE(score,0)) FROM score
    -> JOIN team ON score.teamid = team.id
    -> WHERE team.teamName = 'ECNU';
+------------------------+
| SUM(COALESCE(score,0)) |
+------------------------+
|                    170 |
+------------------------+
1 row in set (0.00 sec)
```

9. 写出SQL语句，删除user表中个人信息的记录。
```sql
mysql> DELETE FROM score WHERE userid IN (SELECT id FROM user);
Query OK, 4 rows affected (0.01 sec)

mysql> DELETE FROM user;
Query OK, 7 rows affected (0.01 sec)
```